dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2802x/examples/structs/sw_prioritized_interrupts/Example_2802xSWPrioritizedDefaultIsr.c
//###########################################################################
//
// FILE:    Example_2802xSWPrioritizedDefaultIsr.c
//
// TITLE:   f2802x Device Default Software Prioritized Interrupt Service 
//          Routines.
//
//          This file is based on the standard 
//          f2802x_SWPrioritizedDefaultIsr.c. The ISR routines have been 
//          modified slightly to provide a trace mechanism used for this 
//          example
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright:
// Copyright (C) 2009-2022 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

//
// Included Files
//
#include "DSP28x_Project.h"     // Device Headerfile and Examples Include File
#include "f2802x_swprioritizedisrlevels.h"

//
// Globals
//

//
// Defined in the Example_28xSWPrioritizedInterrupts.c file
// for this example only
//
extern uint16_t ISRTrace[50];
extern uint16_t ISRTraceIndex;

//
// Used for ISR delays
//
uint16_t i;

//
// INT13_ISR - INT13 or CPU-Timer1 is connected to INT13/TINT1 of CPU 
// (use MINT13 mask)
//
#if (INT13PL != 0)
__interrupt void
INT13_ISR(void)
{
    IER |= MINT13;                 // Set "global" priority
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}
#endif

//
// INT14_ISR - CPU-Timer2 is connected to INT14/TINT2 of CPU (use MINT14 mask)
//
#if (INT14PL != 0)
__interrupt void
INT14_ISR(void)
{
    IER |= MINT14;                  // Set "global" priority
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}
#endif

//
// DATALOG_ISR - Datalogging interrupt is connected to INT15 of CPU
// (use MINT15 mask)
//
#if (INT15PL != 0)
__interrupt void
DATALOG_ISR(void)
{
    IER |= MINT15;                  // Set "global" priority
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}
#endif

//
// RTOSINT_ISR - RTOS interrupt is connected to INT16 of CPU (use MINT16 mask)
//
#if (INT16PL != 0)
__interrupt void
RTOSINT_ISR(void)
{
    IER |= MINT16;                  // Set "global" priority
    EINT;

    //
    // Insert ISR Code here
    //

    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}
#endif

//
// EMUINT_ISR - Emulation interrupt is connected to EMUINT of CPU(non-maskable)
//
__interrupt void
EMUINT_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// NMI_ISR - Non-maskable interrupt is connected to NMI of CPU (non-maskable)
//
__interrupt void
NMI_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// ILLEGAL_ISR - Illegal operation TRAP is connected to ITRAP of CPU
// (non-maskable)
//
__interrupt void
ILLEGAL_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER1_ISR - User Defined trap 1 is connected to USER1 of CPU (non-maskable)
//
__interrupt void
USER1_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER2_ISR - User Defined trap 2 is connected to USER2 of CPU (non-maskable)
//
__interrupt void
USER2_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER3_ISR - User Defined trap 3 is connected to USER3 of CPU (non-maskable)
//
__interrupt void
USER3_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER4_ISR - User Defined trap 4 is connected to USER4 of CPU (non-maskable)
//
__interrupt void
USER4_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER5_ISR - User Defined trap 5 is connected to USER5 of CPU (non-maskable)
//
__interrupt void
USER5_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER6_ISR - User Defined trap 6 is connected to USER6 of CPU (non-maskable)
//
__interrupt void
USER6_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER7_ISR - User Defined trap 7 is connected to USER7 of CPU (non-maskable)
//
__interrupt void
USER7_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER8_ISR - User Defined trap 8 is connected to USER8 of CPU (non-maskable)
//
__interrupt void
USER8_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER9_ISR - User Defined trap 9 is connected to USER9 of CPU (non-maskable)
//
__interrupt void
USER9_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER10_ISR - User Defined trap 10 is connected to USER10 of CPU (non-maskable)
//
__interrupt void
USER10_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER11_ISR - User Defined trap 11 is connected to USER11 of CPU (non-maskable)
//
__interrupt void
USER11_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// USER12_ISR - User Defined trap 12 is connected to USER12 of CPU (non-maskable)
//
__interrupt void
USER12_ISR(void)
{
    EINT;

    //
    // Insert ISR Code here
    //
    
    //
    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    //
    __asm ("      ESTOP0");
    for(;;);
}

//
// PIE Group 1 - MUXed into CPU INT1
//

//
// ADCINT1_ISR - ADC is connected to PIEIER1_1 (use MINT1 and MG11 masks)
//
#if (G11PL != 0)
__interrupt void
ADCINT1_ISR( void )
{
    //
    // Set interrupt priority
    //
    volatile Uint16 TempPIEIER = PieCtrlRegs.PIEIER1.all;
    IER |= M_INT1;
    IER	&= MINT1;	  	               // Set "global" priority
    PieCtrlRegs.PIEIER1.all &= MG11;   // Set "group"  priority
    PieCtrlRegs.PIEACK.all = 0xFFFF;   // Enable PIE interrupts
    __asm("  NOP");
    EINT;

    //
    // Insert ISR Code here
    //
    for(i = 1; i <= 10; i++)
    {
        
